{
  "backend/main.mo": "Motoko actor that manages door entries with CRUD operations, calculates square footage, and computes totals grouped by coating type (single, double, doubleSagwan, laminate).",
  "feature_evidence.json": "Feature evidence report documenting that the React Query hooks in useQueries.ts were reviewed and fixed for actor initialization timing and error handling issues.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing the purpose and recent changes of each component, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the root div and loading the main TypeScript module with responsive viewport settings.",
  "frontend/src/App.tsx": "Root React component that composes the full application layout including customer info, door entry form, entry list, grand totals, quotation actions, theme toggle, and footer.",
  "frontend/src/components/CustomerInfoForm.tsx": "Controlled form component for entering customer name and mobile number, rendered inside a Card with icon-decorated inputs.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding a door entry by height and width (with fraction support); on submit it rounds dimensions and adds all four coating types via the addDoor mutation.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of all door entries with per-entry coating cost calculations, delete functionality, and a totals footer row. Handles loading, error, and empty states.",
  "frontend/src/components/GrandTotals.tsx": "Renders a summary card showing grand totals for all four coating types and total square footage, calculated from all door entries.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate a printable HTML quotation or share it via WhatsApp, then clears all entries and customer info on success.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, adding, deleting, and bulk-deleting door entries via the ICP backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state, persisting the preference to localStorage and applying the appropriate CSS class to the document root.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines a wood-inspired OKLCH color palette for both light and dark modes, plus a touch-target utility class.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/coatingRates.ts": "Defines per-square-foot coating rates (single, double, doubleSagwan, laminate) and exports helpers to get a rate by CoatingType enum and calculate all coating amounts for a given square footage.",
  "frontend/src/utils/dimensionRounding.ts": "Provides rounding logic for door height and width to standard carpenter sizes, including priority-ordered combined rules (e.g., 40×80 and 38×78 special cases) via roundHeight, roundWidth, and roundDimensions functions.",
  "frontend/src/utils/fractionParser.ts": "Parses door dimension inputs in decimal or fractional (eighths) string format into decimal values, and converts decimals back to fraction display strings like '78 2/8'.",
  "frontend/src/utils/pdfGenerator.ts": "Generates an HTML quotation document string for a list of door entries, showing per-entry dimensions, square footage, and all four coating type amounts plus a summary section with totals.",
  "frontend/src/utils/squareFeetCalculator.ts": "Single-function utility that calculates square feet from rounded height and width using the formula (height × width) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Shares a door quotation file and pre-formatted text message via the Web Share API (with file support) or falls back to opening WhatsApp Web with a URL-encoded message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends theme with custom fonts, border radii, accordion animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a fix request to resolve backend errors where getDoorEntries and getTotals calls fail, causing 'Error loading' messages on page load."
}