{
  "backend/main.mo": "Motoko actor implementing a door measurement backend with CRUD operations for door entries, square footage calculation, and aggregated totals grouped by coating type.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of carpenter-style dimension rounding rules in `frontend/src/utils/dimensionRounding.ts`, with two priority-ordered rules for rounding width/height to standard sizes.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module for the Door Measurement & Quotation App.",
  "frontend/src/App.tsx": "Root React component that composes the full application layout including customer info, door entry form, entry list, grand totals, quotation actions, theme toggle, and footer with state management for customer data and refresh triggers.",
  "frontend/src/components/CustomerInfoForm.tsx": "Card-based form component for capturing optional customer name and mobile number with icon-enhanced inputs for use in quotation generation.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding door entries that parses decimal/fraction dimension inputs, applies `roundDimensions` rounding rules, and submits all four coating types to the backend via mutation.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a paginated table of door entries with delete functionality, showing per-entry coating cost calculations and column totals. Handles loading, error, and empty states with retry support.",
  "frontend/src/components/GrandTotals.tsx": "Renders a summary card showing grand totals for square footage and all four coating types (single, double, sagwan, laminate) computed from all door entries.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate a printable HTML quotation or share it via WhatsApp, then clears all entries and customer info on success.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook, displaying a sun or moon icon accordingly.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations: fetching door entries and totals, adding a door, deleting a single door, and deleting all doors.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state, persisting the preference to localStorage and syncing it with the document root class.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines a wood-inspired OKLCH color palette for light and dark modes, plus a utility class for touch targets.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/coatingRates.ts": "Defines per-square-foot coating rates (Single, Double, DoubleSagwan, Laminate) and exports helper functions to get a rate by coating type and calculate all coating amounts for a given square footage.",
  "frontend/src/utils/dimensionRounding.ts": "Implements two priority-ordered carpenter-style rounding rules for door dimensions: widths >38 round to 40×80, widths >36 round to 38×78; otherwise actual dimensions are returned unchanged for internal calculation use only.",
  "frontend/src/utils/fractionParser.ts": "Provides utilities to parse door dimension inputs in decimal or fractional (eighths) format, convert decimals back to fraction display strings, and validate dimension inputs.",
  "frontend/src/utils/pdfGenerator.ts": "Generates an HTML quotation document for door entries showing actual entered dimensions in the table while computing all coating-type amounts and totals from rounded square footage values.",
  "frontend/src/utils/squareFeetCalculator.ts": "Calculates square footage from rounded dimensions using the formula (roundedHeight × roundedWidth) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Shares a door quotation file and pre-formatted summary message via the Web Share API or falls back to opening WhatsApp Web with an encoded message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based design tokens, custom fonts, border radii, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the project's architectural notes, existing features, and pending feature requests (AR-1 through AR-5) related to carpenter-style dimension rounding, square footage calculation, PDF display, and component updates."
}