{
  "backend/main.mo": "Motoko actor defining door entry types (single, double, doubleSagwan, laminate coatings) with CRUD operations: addDoor, getAllTypes, getTotalSquareFeet (returns ComputeTotals with per-coating and grand totals), and deleteDoor; calculates square feet from rounded dimensions.",
  "feature_evidence.json": "Feature evidence report documenting the customer data reset functionality in App.tsx that clears name and mobile fields after quotation generation, coordinating with door entries clearing behavior.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the door quotation app with fraction input support, grouped display by size, four coating types per door, customer info form, PDF/WhatsApp sharing, and theme toggle functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with wood-inspired warm palette for construction industry aesthetic.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Door Measurement & Quotation App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component managing customer info state (name, mobile), door entry form with reset ref, entry list, grand totals, and quotation actions; clears customer data and triggers form reset after quotation generation via handleQuotationGenerated callback.",
  "frontend/src/components/CustomerInfoForm.tsx": "Controlled form component with icon-enhanced inputs for customer name and mobile number, receiving values and change handlers as props for parent state management.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding door entries with fraction/decimal input support; exposes resetForm via imperative ref handle, rounds dimensions, and creates all 4 coating type entries per submission using useAddDoor mutation.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of door entries grouped by size, showing coating costs (single, double, double+sagwan, laminate) per door size with delete functionality for each group.",
  "frontend/src/components/GrandTotals.tsx": "Shows grand total square feet and aggregated coating costs across all door entries, displaying only non-zero coating type totals.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate a PDF quotation and share it via WhatsApp; clears all door entries after successful PDF generation.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching door entries, totals, and mutations for adding/deleting doors via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages theme state (light/dark) with localStorage persistence and system preference detection.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom wood-inspired color palettes for light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/coatingRates.ts": "Exports constant rates per square foot for four coating types: single (185), double (220), double+sagwan (270), and laminate (450).",
  "frontend/src/utils/dimensionRounding.ts": "Provides functions to round door heights (72-84 inches) and widths (30-48 inches) to standard Indian carpenter sizes based on threshold rules.",
  "frontend/src/utils/fractionParser.ts": "Parses and validates door dimension inputs in decimal or fraction format (supporting eighths), and converts decimals to fraction display format.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML-based quotation PDFs with customer info, grouped door entries by size, coating calculations, and formatted pricing using Indian currency formatting.",
  "frontend/src/utils/squareFeetCalculator.ts": "Calculates square feet from rounded door dimensions using the formula (height × width) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Shares quotation PDFs via WhatsApp using Web Share API when available, with fallback to opening WhatsApp with a text message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking feature requests to clear customer name and mobile number fields after quotation generation, with pending implementation status."
}