{
  "backend/main.mo": "Motoko actor defining door entry types (single, double, doubleSagwan, laminate coatings) with CRUD operations: addDoor, getAllTypes, getTotalSquareFeet (aggregated by coating type), and deleteDoor; calculates square feet from rounded dimensions.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing PDF generation, fixing WhatsApp sharing on mobile/desktop, and adding error handling/user feedback to QuotationActions component.",
  "frontend-file-summaries.txt": "Text file containing pre-existing summaries of frontend source files including components, hooks, and utilities for the door quotation application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with wood-inspired palette and construction industry aesthetic.",
  "frontend/index.html": "HTML entry point for the Door Measurement & Quotation App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component orchestrating QueryClient, customer info state, door entry form with reset ref, door list, grand totals, quotation actions, theme toggle, toast notifications, and footer with caffeine.ai attribution.",
  "frontend/src/components/CustomerInfoForm.tsx": "Controlled form component with icon-enhanced inputs for customer name and mobile number, receiving values and change handlers as props for quotation generation.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding door entries supporting fraction/decimal input; parses dimensions, rounds them, creates all 4 coating type entries per submission, exposes reset function via imperative ref, and includes clear button.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of door entries grouped by size with calculated square footage and coating costs (single, double, double sagwan, laminate). Supports deletion of door size groups and shows totals in a footer.",
  "frontend/src/components/GrandTotals.tsx": "Shows a summary card with total square feet and calculated costs for each coating type (single, double, double sagwan, laminate) using predefined rates. Fetches totals from backend and displays them in a grid layout.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate PDF quotations and share via WhatsApp. Validates customer info and door entries, generates HTML quotations, and clears data after successful generation/sharing.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook, displaying sun/moon icons based on current theme.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and handles identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for door entry CRUD operations (get all, add, delete, delete all) and fetching total square feet calculations. All mutations invalidate relevant queries on success.",
  "frontend/src/hooks/useTheme.ts": "Manages theme state (light/dark) with localStorage persistence and system preference detection. Applies theme by toggling the 'dark' class on the document root element.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom wood-inspired color palette for light and dark modes using CSS custom properties. Includes base styles and utility classes for touch targets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/utils/coatingRates.ts": "Defines constant pricing rates in Rupees per square foot for four coating types: single (185), double (220), double sagwan (270), and laminate (450).",
  "frontend/src/utils/dimensionRounding.ts": "Provides functions to round door heights (72-84 inches) and widths (30-48 inches) to standard Indian carpenter sizes based on threshold rules.",
  "frontend/src/utils/fractionParser.ts": "Parses and validates door dimension inputs supporting decimal and fraction formats (eighths), with conversion utilities between decimal and fraction display formats.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML quotation documents by grouping door entries by size, calculating costs per coating type, and formatting with customer details and totals.",
  "frontend/src/utils/squareFeetCalculator.ts": "Calculates square footage from rounded door dimensions using the formula (height × width) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Handles sharing PDF quotations via WhatsApp using Web Share API on supported devices, with fallback to WhatsApp Web URL with pre-filled message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, animations, typography, and container query plugins.",
  "project_state.json": "Project metadata tracking known issues with PDF generation/print functionality and feature requests to fix quotation generation and WhatsApp sharing."
}