{
  "backend/main.mo": "Main actor defining door entry types (CoatingType, DoorEntry) and CRUD operations (addDoor, getAll, getTotals, deleteDoor, getEntry) with square feet calculation and coating type totals aggregation.",
  "backend/migration.mo": "Migration module that copies door entries and nextId from old actor state to new actor state during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting four features that remove grouping logic from DoorEntryList, GrandTotals, pdfGenerator, and whatsappShare to display all entries individually.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend TypeScript/React files covering components, hooks, utilities for door entry management, quotation generation, and UI theming.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, and other design tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tags and root div for React app mounting.",
  "frontend/src/App.tsx": "Root React component orchestrating customer info form, door entry form/list, grand totals, quotation actions, theme toggle, and footer with state management for customer data and refresh triggers.",
  "frontend/src/components/CustomerInfoForm.tsx": "Form component with icon-enhanced inputs for customer name and mobile number used in quotation generation.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file (no content provided).",
  "frontend/src/components/DoorEntryForm.tsx": "Form for adding door entries with fraction/decimal dimension parsing; automatically creates entries for all 4 coating types (single, double, doubleSagwan, laminate) using rounded dimensions.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of door entries with dimensions, square footage, and calculated coating costs (single, double, double+sagwan, laminate). Supports deletion of individual entries and shows totals in the footer.",
  "frontend/src/components/GrandTotals.tsx": "Shows a summary card with total square footage and calculated costs for all four coating types across all door entries. Displays loading and error states with retry functionality.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate a printable HTML quotation or share it via WhatsApp. Clears all entries and customer info after successful generation or sharing.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook, displaying sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Creates and manages AuthClient with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching door entries, totals, and mutations for adding/deleting individual or all door entries. Automatically invalidates related queries on mutations.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and system preference detection. Applies theme by toggling the 'dark' class on the document root.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a wood-inspired color palette supporting light and dark modes, plus utility classes for touch-friendly targets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/coatingRates.ts": "Defines coating rate constants (single, double, double sagwan, laminate) and provides functions to get rates by coating type and calculate amounts for all coating types given square footage.",
  "frontend/src/utils/dimensionRounding.ts": "Provides functions to round door height and width to standard carpenter sizes using custom threshold rules (e.g., >78 and ≤80 → 80, >80 and ≤84 → 84).",
  "frontend/src/utils/fractionParser.ts": "Parses dimension inputs supporting decimal and fraction formats (e.g., '78 2/8'), validates Indian fractions (eighths), and converts decimals back to fraction display format.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML quotation documents listing all door entries individually with dimensions, square feet, and amounts for all four coating types, plus totals summary.",
  "frontend/src/utils/squareFeetCalculator.ts": "Calculates square feet from rounded door dimensions using the formula (height × width) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Shares quotation via WhatsApp using Web Share API or fallback URL, formatting all door entries individually with dimensions and amounts for all coating types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme with custom colors using OKLCH color space, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking known issues with door entries being merged by size instead of stored as unique array items, with pending feature requests to fix backend/frontend storage using unique IDs."
}