{
  "backend/main.mo": "Motoko actor defining door entry types (CoatingType, DoorEntry, AddDoorInput) and CRUD operations (addDoor, getAll, getTotals, deleteDoor) with square feet calculation and totals aggregation by coating type.",
  "feature_evidence.json": "Feature evidence report documenting four requirements to update PDF and WhatsApp outputs to display only actual entered dimensions with fractions instead of rounded dimensions, and to update or remove calculation notes.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including components for door entry forms, lists, totals, quotation actions, PDF generation, WhatsApp sharing, and utility functions for fractions, rates, and dimension rounding.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Door Measurement & Quotation App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component managing customer info state, refresh triggers, and form reset; renders header with theme toggle, customer info form, door entry form, door list, grand totals, quotation actions, and footer with caffeine.ai attribution.",
  "frontend/src/components/CustomerInfoForm.tsx": "Card component with two input fields (customer name and mobile number) using User and Phone icons, controlled by parent component via props.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding door entries with height/width inputs supporting fractions; parses dimensions, rounds them, and creates all 4 coating type entries (single, double, doubleSagwan, laminate) for each door size submission with form reset capability.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of door entries grouped by size with calculated coating costs (single, double, double sagwan, laminate) and square footage totals. Supports deleting door groups and refreshing data with loading/error states.",
  "frontend/src/components/GrandTotals.tsx": "Shows grand totals card with total square feet and calculated amounts for all coating types across all door entries. Displays loading/error states and formats currency in Indian locale.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate PDF quotations and share via WhatsApp, requiring customer name/mobile and door entries. Clears all data after successful generation or sharing.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using the useTheme hook, displaying sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for door entry CRUD operations (getAll, getTotals, add, delete, deleteAll) using the backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and system preference detection, applying theme class to document root.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a wood-inspired color palette for light and dark modes, plus utility classes for touch-friendly targets.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/coatingRates.ts": "Defines coating rate constants (single, double, double sagwan, laminate) and provides functions to get rates by coating type and calculate amounts for all coating types given square footage.",
  "frontend/src/utils/dimensionRounding.ts": "Implements Indian carpenter standard rounding rules for door heights (72-84 inches) and widths (30-48 inches) based on threshold values.",
  "frontend/src/utils/fractionParser.ts": "Parses and validates door dimension inputs supporting both decimal and fraction formats (eighths), and converts decimals back to fraction display format.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML for door quotation PDFs, grouping doors by size, displaying entered dimensions with fractions, and calculating all coating type amounts for each door and totals.",
  "frontend/src/utils/squareFeetCalculator.ts": "Calculates square footage from rounded door dimensions using the formula (height × width) / 144.",
  "frontend/src/utils/whatsappShare.ts": "Formats and shares door quotations via WhatsApp, grouping doors by size, displaying entered dimensions with fractions, and showing all coating type amounts using Web Share API or fallback URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, border radius variables, custom fonts, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking architectural decisions to display only entered dimensions (not rounded) in all user-facing outputs while using rounded values internally for calculations."
}