{
  "backend/main.mo": "Main actor defining DoorType with multi-coating support (single, double, doubleSagwan, laminate), storing door types by ID with rounded dimensions and square footage calculations, and providing queries for totals and coating-specific amounts with fixed rates per coating type.",
  "backend/migration.mo": "Migration module that transforms old door entry structure (with doorType, rate, quantity, amount fields) to new structure with CoatingType flags and typesMap, initializing with empty map and preserving nextId.",
  "feature_evidence.json": "Feature evidence report documenting five high-confidence features for changing door count logic to unique sizes, restructuring the table with coating columns, removing rate displays, updating totals section, and ensuring UI/PDF consistency.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 14 frontend files describing components for door entry forms with multi-select coatings, table display with coating amount columns, totals display, PDF generation, WhatsApp sharing, theme management, and customer info capture.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Door Measurement & Quotation App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component orchestrating header with theme toggle, customer info form, door entry form with reset coordination, door entry list, and quotation actions with refresh triggers and form reset after quotation generation.",
  "frontend/src/components/CustomerInfoForm.tsx": "Card-based form component with icon-enhanced inputs for capturing customer name and mobile number, using controlled components with onChange callbacks for parent state management.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Display component for rendering a single door entry with door type, rounded size, square feet, rate, quantity, and formatted amount in Indian Rupees with comma separators (file content truncated in input).",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding new door entries with height, width, and multiple coating type selections (single, double, double+sagwan, laminate). Handles form submission, validation, and reset functionality via imperative handle.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of all door entries with dimensions, square footage, and calculated coating amounts for each type. Includes delete functionality with loading states and error handling.",
  "frontend/src/components/GrandTotals.tsx": "Shows aggregate totals including total square feet and sum amounts for each coating type across all door entries. Displays data in formatted cards with currency formatting.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate PDF quotations and share via WhatsApp. Clears all door entries after successful PDF generation and manages PDF blob state for sharing.",
  "frontend/src/components/ThemeToggle.tsx": "Simple toggle button component that switches between light and dark themes using a custom useTheme hook. Displays sun/moon icons based on current theme.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity persistence, and authentication status states throughout the application.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for door type management, providing queries for fetching all door types, total square feet, and coating amounts, plus mutations for adding doors and deleting door types with automatic cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Custom React hook for managing light/dark theme state with localStorage persistence and system preference detection, applying theme class to document root.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom wood-inspired color palette for light and dark modes using OKLCH color space, plus factory-friendly utility classes for touch targets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/pdfGenerator.ts": "Utility for generating HTML-based PDF quotations with customer details, door types, square footage calculations, and coating amounts formatted with Indian currency styling.",
  "frontend/src/utils/whatsappShare.ts": "Utility for sharing PDF quotations via WhatsApp using Web Share API when available, falling back to WhatsApp Web/app URL scheme with pre-filled message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending default theme with custom OKLCH color system, container settings, border radius variables, custom fonts, and accordion animations.",
  "project_state.json": "Project metadata describing a Flutter/Dart Android door calculation app with custom rounding logic, multi-coating selection, PDF generation, and WhatsApp sharing capabilities."
}