{
  "backend/main.mo": "Main Motoko actor implementing door quotation backend with CRUD operations for door entries, coating calculations (single, double, double+sagwan, laminate), square footage computation, and migration support; stores both entered text dimensions and rounded numeric values.",
  "backend/migration.mo": "Migration module that transforms old door data structure (Float height/width) to new structure (Text enteredHeight/enteredWidth) by converting Float values to Text while preserving all other fields.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including fraction input support, actual size display (not rounded), table column removal, WhatsApp PDF sharing, and confirmation message updates with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components for door entry forms with fraction support, display tables showing actual entered dimensions, PDF generation, WhatsApp sharing, and theme management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode color variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Door Measurement & Quotation App with viewport meta tag and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component orchestrating customer info form, door entry form with reset coordination, door list, quotation actions, theme toggle, and header with refresh trigger state management for entry changes and quotation generation.",
  "frontend/src/components/CustomerInfoForm.tsx": "Card-based form component with icon-enhanced inputs for capturing customer name and mobile number for quotation generation.",
  "frontend/src/components/DoorEntryDisplay.tsx": "Display component for individual door entry showing door type, rounded size, square feet, rate, quantity, and formatted total amount in Indian Rupees with proper numeric rate handling.",
  "frontend/src/components/DoorEntryForm.tsx": "Form component for adding new door entries with dimension inputs (supporting fractions), multiple coating type checkboxes, and validation. Handles form submission, reset, and displays loading states.",
  "frontend/src/components/DoorEntryList.tsx": "Displays a table of all door entries with dimensions, coating amounts calculated per type, square footage, and delete functionality. Shows loading and error states.",
  "frontend/src/components/GrandTotals.tsx": "Displays total square feet and aggregated coating amounts across all door entries in styled cards. Handles loading and error states.",
  "frontend/src/components/QuotationActions.tsx": "Provides buttons to generate PDF quotations and share via WhatsApp. Clears all door entries after successful PDF generation.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity state management. Creates AuthClient with configurable options and handles identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching door types, total square feet, and coating amounts, plus mutations for adding doors and deleting door types with automatic cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Custom hook managing light/dark theme state with localStorage persistence and system preference detection.",
  "frontend/src/index.css": "Tailwind CSS configuration with wood-inspired color palette for light/dark modes using OKLCH color space and factory-friendly touch target utilities.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the root App component.",
  "frontend/src/utils/fractionParser.ts": "Utility functions for parsing door dimensions in decimal or fraction format (eighths), validating inputs, and converting between decimal and fraction display formats.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML-based quotation documents with customer details, door types, coating amounts, and totals formatted for PDF export.",
  "frontend/src/utils/whatsappShare.ts": "Handles WhatsApp sharing of quotation PDFs using Web Share API with fallback to WhatsApp Web/app URL schemes for mobile and desktop.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH colors, wood-inspired palette, typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing a Flutter/Dart Android door calculation app with custom rounding logic, multi-coating selection, PDF generation, and WhatsApp sharing features."
}