{
  "kind": "build_request",
  "title": "Fix duplicate door size entries being merged/overwritten",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend main.mo to store door entries using unique IDs instead of keying by size. Change the data structure from a HashMap keyed by size to an array-based storage where each entry has a unique identifier (e.g., Nat incrementing ID). Ensure addDoor generates a new unique ID for each entry regardless of dimensions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use a unique ID (UUID / timestamp / incremental id) for each door entry.",
          "Do NOT use size as a key in state, map, reducer, or backend storage.",
          "Store door entries as an ARRAY of objects, not a keyed object."
        ]
      },
      "acceptanceCriteria": [
        "Each door entry has a unique ID field",
        "Door entries are stored in an array, not keyed by size",
        "Multiple entries with identical dimensions can coexist",
        "addDoor method generates and assigns unique IDs automatically"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update frontend DoorEntryForm.tsx to ensure each door entry created includes a unique identifier. When creating entries for all four coating types, each must receive its own unique ID. Remove any logic that uses size as a key or identifier.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use a unique ID (UUID / timestamp / incremental id) for each door entry.",
          "Same size + same coating must still show as separate rows."
        ]
      },
      "acceptanceCriteria": [
        "Each door entry submission generates a unique ID",
        "Multiple entries with same dimensions are allowed",
        "No size-based keying in form logic"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update frontend DoorEntryList.tsx to display door entries as individual rows without grouping by size. Remove any grouping, merging, or size-based indexing logic. Display all entries sequentially with incrementing Sr No for each row, treating each entry as unique regardless of dimensions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Each entry must be treated as a UNIQUE row.",
          "No auto-merge, no overwrite, no grouping by size.",
          "Sr No must increment for every entry.",
          "Same size + same coating must still show as separate rows."
        ]
      },
      "acceptanceCriteria": [
        "All door entries display as separate rows",
        "No grouping by size occurs",
        "Sr No increments sequentially for every entry",
        "Entries with identical dimensions appear as distinct rows"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update frontend hooks/useQueries.ts (or equivalent door entry management hooks) to handle door entries as an array of unique objects. Remove any size-based keying in query result processing or state management. Ensure mutations and cache updates treat each entry independently by ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Store door entries as an ARRAY of objects, not a keyed object.",
          "Do NOT use size as a key in state, map, reducer, or backend storage."
        ]
      },
      "acceptanceCriteria": [
        "Door entries are managed as an array in frontend state",
        "No size-based keying in React Query hooks",
        "Each entry is identified by unique ID for updates/deletes"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update GrandTotals.tsx to calculate totals by iterating through all door entries in the array and summing amounts and square feet across all rows. Ensure the calculation includes every entry even if dimensions are identical.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Totals must be calculated by summing ALL rows, even if size is same.",
          "Totals must reflect sum of all rows."
        ]
      },
      "acceptanceCriteria": [
        "Totals sum all entries including duplicates",
        "Grand total square feet includes all rows",
        "Amount calculations account for every entry"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update pdfGenerator.ts to list all door entries as separate line items in the PDF output without grouping by size. Each entry must appear as an individual row with its own dimensions, square feet, coating type, and amount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "PDF, Print, and WhatsApp share must list all entries separately."
        ]
      },
      "acceptanceCriteria": [
        "PDF shows all entries as individual rows",
        "No grouping by size in PDF output",
        "Each entry displays complete information"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update whatsappShare.ts to format all door entries as separate line items in the WhatsApp message without grouping by size. Each entry must be listed individually with its dimensions, square feet, coating type, and amount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "PDF, Print, and WhatsApp share must list all entries separately."
        ]
      },
      "acceptanceCriteria": [
        "WhatsApp message lists all entries separately",
        "No grouping by size in message formatting",
        "Each entry includes complete details"
      ]
    }
  ],
  "constraints": [
    "Do not change existing dimension rounding rules",
    "Do not modify coating rates",
    "Do not alter UI layout or styling",
    "Preserve all calculation logic for square feet and amounts"
  ],
  "nonGoals": [
    "Auto-increasing quantity for duplicate sizes",
    "Grouping or consolidating entries with same dimensions",
    "Changes to dimension input parsing",
    "Modifications to theme or visual design"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}