{
  "kind": "build_request",
  "title": "Fix door entries and totals loading errors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Debug and fix the 'Error loading door entries. Please try again.' error displayed in the DoorEntryList component by investigating the useQuery hook for fetching door entries and ensuring proper error handling and retry logic",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Error loading door entries. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "Door entries load successfully without showing error messages",
        "If backend query fails, provide meaningful error feedback with retry capability",
        "Loading states are properly handled with appropriate UI indicators"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Debug and fix the 'Error loading totals. Please try again.' error displayed in the GrandTotals component by investigating the useQuery hook for calculating totals and ensuring proper error handling",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Error loading totals. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "Grand totals calculate and display correctly without error messages",
        "Error handling provides clear feedback if backend calculation fails",
        "Totals update automatically when door entries change"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify backend actor availability and ensure the getAllTypes and getTotalSquareFeet methods are functioning correctly and accessible from the frontend queries",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "Backend actor methods respond successfully to frontend queries",
        "Network connectivity issues are handled gracefully",
        "Authentication state is properly managed for backend calls"
      ]
    }
  ],
  "constraints": [
    "Do not change the backend schema or main.mo structure",
    "Preserve existing useQueries.ts query invalidation logic",
    "Maintain current authentication flow with Internet Identity"
  ],
  "nonGoals": [
    "Redesigning the error message UI styling",
    "Adding new features beyond fixing the loading errors",
    "Changing the door entry or totals calculation logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}