{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix duplicate door size entries being merged/overwritten",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update DoorEntryForm to ensure each door entry includes a unique identifier and remove size-based keying logic",
      "acceptanceCriteria": [
        "Each door entry submission generates a unique ID",
        "Multiple entries with same dimensions are allowed",
        "No size-based keying in form logic"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryForm.tsx",
          "operation": "modify",
          "description": "Remove any logic that uses size as a key or identifier. Ensure the form relies on the backend to generate unique IDs for each door entry. When creating entries for all four coating types, verify each receives its own unique ID from the backend response. Update the submission logic to handle door entries as independent objects identified by backend-generated IDs."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update DoorEntryList to display all door entries as individual rows without grouping by size",
      "acceptanceCriteria": [
        "All door entries display as separate rows",
        "No grouping by size occurs",
        "Sr No increments sequentially for every entry",
        "Entries with identical dimensions appear as distinct rows"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryList.tsx",
          "operation": "modify",
          "description": "Remove all grouping, merging, or size-based indexing logic. Display door entries as a flat list where each entry is rendered as an individual table row. Update Sr No to increment sequentially for every entry in the array (1, 2, 3, ...). Treat each entry as unique based on its ID field regardless of dimensions. Ensure delete operations use the unique ID to target specific entries."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update useQueries hooks to handle door entries as an array of unique objects without size-based keying",
      "acceptanceCriteria": [
        "Door entries are managed as an array in frontend state",
        "No size-based keying in React Query hooks",
        "Each entry is identified by unique ID for updates/deletes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update query result processing to treat door entries as an array of unique objects. Remove any size-based keying or transformation logic in query results. Ensure mutations and cache updates identify entries by their unique ID field. Update the deleteDoor mutation to use the entry's unique ID. Verify cache invalidation handles entries as an array without size-based grouping."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update GrandTotals to calculate totals by iterating through all door entries in the array",
      "acceptanceCriteria": [
        "Totals sum all entries including duplicates",
        "Grand total square feet includes all rows",
        "Amount calculations account for every entry"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GrandTotals.tsx",
          "operation": "modify",
          "description": "Ensure the totals calculation iterates through all door entries in the array and sums amounts and square feet across all rows. Verify the calculation includes every entry even if dimensions are identical. Remove any logic that might skip or merge entries with the same size."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update pdfGenerator to list all door entries as separate line items without grouping by size",
      "acceptanceCriteria": [
        "PDF shows all entries as individual rows",
        "No grouping by size in PDF output",
        "Each entry displays complete information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Remove grouping-by-size logic in PDF generation. Update the HTML quotation template to iterate through all door entries as a flat array, rendering each entry as an individual line item with its own dimensions, square feet, coating type, and amount. Ensure Sr No increments for every entry. Verify totals include all entries even if dimensions are identical."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update whatsappShare to format all door entries as separate line items without grouping by size",
      "acceptanceCriteria": [
        "WhatsApp message lists all entries separately",
        "No grouping by size in message formatting",
        "Each entry includes complete details"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/whatsappShare.ts",
          "operation": "modify",
          "description": "Remove grouping-by-size logic in WhatsApp message formatting. Update the message builder to iterate through all door entries as a flat array, formatting each entry as a separate line item with its dimensions, square feet, coating type, and amount. Ensure all entries appear individually in the message regardless of identical dimensions. Verify totals sum all entries."
        }
      ]
    }
  ]
}