{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clear customer info after quotation generation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Clear customer name and mobile number input fields after successful quotation PDF generation",
      "acceptanceCriteria": [
        "Customer name field is reset to empty after PDF generation",
        "Mobile number field is reset to empty after PDF generation",
        "Fields are only cleared after successful quotation generation, not on failure",
        "The clearing happens automatically without requiring user action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CustomerInfoForm.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that listens to a resetTrigger prop to clear the customer name and mobile number input fields. When the resetTrigger changes, reset both controlled input values to empty strings. This ensures the form fields are cleared automatically after successful quotation generation without requiring user interaction."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update App.tsx to reset customer data state after quotation generation, coordinating with existing door entries clearing",
      "acceptanceCriteria": [
        "Customer data state in App.tsx is reset after successful quotation generation",
        "Customer data clearing is coordinated with the existing door entries clearing mechanism",
        "The CustomerInfoForm reflects the cleared state immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a customer info reset trigger mechanism that coordinates with the existing door entries clearing flow. Pass a resetTrigger prop to CustomerInfoForm that increments after successful quotation generation in QuotationActions. Also reset the customerData state object (name and mobile) to empty strings when the quotation is successfully generated, ensuring the parent state and child component are synchronized."
        },
        {
          "path": "frontend/src/components/QuotationActions.tsx",
          "operation": "modify",
          "description": "After successful PDF generation in the handleGeneratePDF function, call a new onQuotationGenerated callback prop provided by App.tsx. This callback will trigger both the existing door entries clearing and the new customer info clearing mechanisms. Ensure this callback is only invoked after PDF generation succeeds, not on failure scenarios."
        }
      ]
    }
  ]
}