{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refactor door quotation to use size-based grouping with coating columns",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Change door count logic to count only unique door sizes (height × width combinations)",
      "acceptanceCriteria": [
        "A door with height 78 and width 36 with 4 different coatings selected counts as 1 door",
        "Door count increments only when a new unique size combination is added",
        "Backend groups entries by size and aggregates coatings per size"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryForm.tsx",
          "operation": "modify",
          "description": "Update form submission logic to work with the new size-based backend data model. Ensure the form sends coating selections as part of a single door size entry rather than creating separate entries per coating type."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update query hooks to work with the new backend interface that returns size-grouped door data with coating selections as properties of each size group."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Replace door entries table with size-grouped format showing coating amounts in separate columns",
      "acceptanceCriteria": [
        "Table displays one row per unique door size",
        "Each coating type has its own column showing the calculated amount",
        "If a coating is not selected for a size, its column shows a dash or remains empty",
        "Size column displays format like '78 × 36'",
        "Sq.Ft column shows the square footage for that size"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryDisplay.tsx",
          "operation": "modify",
          "description": "Replace the current entry display with a new table row format displaying: Sr No | Size (formatted as 'H × W') | Single Coating amount | Double Coating amount | Double Coating + Sagwan Patti amount | Laminate amount | Sq.Ft. Show dashes for coatings not selected for that size. Remove rate display entirely."
        },
        {
          "path": "frontend/src/components/DoorEntryList.tsx",
          "operation": "modify",
          "description": "Update to render door entries as a table with column headers (Sr No, Size, Single Coating, Double Coating, Double Coating + Sagwan Patti, Laminate, Sq.Ft) instead of individual cards. Each row represents one unique door size with its coating amounts in separate columns."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Remove all rate displays from UI and PDF, showing only calculated coating amounts",
      "acceptanceCriteria": [
        "Rate field is not visible in the door entries table",
        "Rate is not shown in the PDF quotation",
        "Only coating amounts are displayed, not the rate used to calculate them"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryDisplay.tsx",
          "operation": "modify",
          "description": "Remove all rate (₹/sq.ft) displays from the component. Show only the final calculated amounts for each coating type without exposing the rates used in calculations."
        },
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Update PDF generation logic to exclude rate columns from the quotation table. Display only Sr No, Size, coating amount columns, and Sq.Ft. Ensure no rate information appears anywhere in the generated PDF."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update totals section to show Total Sq.Ft and separate totals per coating type only",
      "acceptanceCriteria": [
        "Totals section displays Total Square Feet",
        "Separate total amounts shown for each coating type (4 coating totals)",
        "Grand Total amount is not displayed",
        "Total Quantity field is not displayed",
        "Backend provides separate totals per coating type"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GrandTotals.tsx",
          "operation": "modify",
          "description": "Replace current totals display with new structure showing: Total Square Feet, and separate total amounts for Single Coating, Double Coating, Double Coating + Sagwan Patti, and Laminate. Remove Grand Total and Total Quantity displays. Update to use backend methods getTotalSquareFeet() and getCoatingTotals()."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or update query hooks to fetch Total Square Feet and separate coating totals from the backend. Create useGetTotalSquareFeet and useGetCoatingTotals hooks that call the respective backend methods."
        },
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Update PDF totals section to match the UI structure: display Total Square Feet and separate totals for each of the 4 coating types. Remove Grand Total and Total Quantity from the PDF output."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Ensure consistent table layout and totals structure between UI preview and PDF",
      "acceptanceCriteria": [
        "PDF displays the same table structure with Sr No | Size | coating columns | Sq.Ft",
        "PDF totals section matches the UI totals section (Total Sq.Ft + coating totals)",
        "Formatting and data presentation are identical between UI and PDF"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Ensure the PDF table structure exactly matches the UI table with columns: Sr No | Size | Single Coating | Double Coating | Double Coating + Sagwan Patti | Laminate | Sq.Ft. Ensure totals section matches UI with Total Square Feet and 4 separate coating totals. Maintain consistent formatting (Indian Rupee symbol, comma separators) between UI and PDF."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Update confirmation message to show count of unique door sizes after quotation generation",
      "acceptanceCriteria": [
        "Message shows actual count of unique door sizes",
        "Message format is 'Quotation generated for 1 door size.' for single size",
        "Message format is 'Quotation generated for X door sizes.' for multiple sizes",
        "Message appears after successful PDF generation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuotationActions.tsx",
          "operation": "modify",
          "description": "Update the success message after PDF generation to display 'Quotation generated for X door size(s).' where X is the count of unique door sizes (not total entries). Use proper singular/plural form based on the count."
        }
      ]
    }
  ]
}