{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove rounded dimensions from PDF display, show only actual entered dimensions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update pdfGenerator.ts to display only actual entered door dimensions with fractions in the PDF table, removing all rounded dimension displays",
      "acceptanceCriteria": [
        "PDF table shows entered dimensions exactly as user typed them",
        "No rounded dimensions appear in the PDF door size column",
        "Fractions (1/8, 5/8, etc.) are preserved in display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Update generateQuotationHTML to use heightEntered and widthEntered instead of heightRounded and widthRounded when displaying door dimensions in the PDF table. Use the fractionParser utility to format entered dimensions with proper fraction display (e.g., 78 2/8 instead of 78.25). Ensure the door size column shows only the entered values with fractions preserved."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove or replace the rounding note in the PDF with a carpenter rules note",
      "acceptanceCriteria": [
        "Original rounding note is removed or replaced",
        "If replaced, new note states 'Calculations are done as per standard carpenter rules. Entered sizes are shown for reference.'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Locate the note text 'All calculations are based on rounded dimensions...' in the HTML generation. Replace it with 'Calculations are done as per standard carpenter rules. Entered sizes are shown for reference.' or remove the note section entirely based on user preference."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update WhatsApp share to display only actual entered dimensions with fractions in the shared message",
      "acceptanceCriteria": [
        "WhatsApp share message shows entered dimensions with fractions",
        "No rounded dimensions appear in WhatsApp message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/whatsappShare.ts",
          "operation": "modify",
          "description": "Update generateWhatsAppMessage to use heightEntered and widthEntered instead of heightRounded and widthRounded when formatting door dimensions. Use the fractionParser utility to format entered dimensions with proper fraction display. Ensure the WhatsApp message shows only entered values with fractions preserved."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update DoorEntryList.tsx to display only actual entered dimensions in the web view table while keeping rounded values for internal calculation",
      "acceptanceCriteria": [
        "Web view table shows entered dimensions with fractions",
        "No rounded dimensions visible in the UI",
        "Square feet calculations still use rounded values internally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryList.tsx",
          "operation": "modify",
          "description": "Update the table rendering to display heightEntered and widthEntered instead of heightRounded and widthRounded in the door size column. Use the fractionParser utility to format entered dimensions with proper fraction display. Keep the squareFeet calculation logic unchanged as it already uses rounded values internally."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Verify print view consistency to ensure printed output shows only actual entered dimensions",
      "acceptanceCriteria": [
        "Print view shows entered dimensions with fractions",
        "Print output matches PDF output for dimension display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Verify that the HTML generation for print view (if separate from PDF view) uses heightEntered and widthEntered with fraction formatting. Ensure print styles and PDF generation share the same dimension display logic so printed output matches PDF output for dimension display."
        }
      ]
    }
  ]
}