{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add fraction input support and actual size display",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Display actual entered door size (with fractions) in table and PDF, not rounded size",
      "acceptanceCriteria": [
        "Table shows actual entered dimensions, not rounded dimensions",
        "PDF quotation shows actual entered dimensions",
        "Rounded size is used only for internal calculations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryList.tsx",
          "operation": "modify",
          "description": "Update the table to display enteredHeight and enteredWidth from DoorType instead of roundedHeight and roundedWidth. Replace the Size column display logic to show actual entered dimensions in the format 'height × width'."
        },
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Update PDF generation to use enteredHeight and enteredWidth fields from DoorType objects instead of roundedHeight and roundedWidth when rendering door dimensions in the PDF table."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add support for inch fractions (0, 1/8, 2/8, 3/8, 4/8, 5/8, 6/8, 7/8) in height and width inputs",
      "acceptanceCriteria": [
        "Height input accepts both decimal and fraction notation",
        "Width input accepts both decimal and fraction notation",
        "Fraction inputs are converted to decimal internally",
        "Original fraction format is preserved for display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/fractionParser.ts",
          "operation": "create",
          "description": "Create utility functions to parse fraction input (e.g., '78 2/8' or '78.25') and convert to decimal for calculations. Include validation for allowed fractions (0, 1/8, 2/8, 3/8, 4/8, 5/8, 6/8, 7/8). Provide function to preserve original input format as string and another to round the decimal value to nearest inch for backend storage."
        },
        {
          "path": "frontend/src/components/DoorEntryForm.tsx",
          "operation": "modify",
          "description": "Update height and width input handlers to accept both decimal and fraction notation. Use the fractionParser utility to convert input to decimal, preserve original format, and round for backend. Update form submission to send both enteredHeight/enteredWidth (original format) and roundedHeight/roundedWidth (rounded values) to the addDoor mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the addDoor mutation to accept AddDoorInput with enteredHeight, enteredWidth, roundedHeight, and roundedWidth fields. Ensure the mutation passes all four dimension fields to the backend addDoor function."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Remove Rate and Quantity columns from door entries table",
      "acceptanceCriteria": [
        "Rate column is not visible in table",
        "Quantity column is not visible in table",
        "All coating amount columns are visible",
        "Square feet column is visible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoorEntryList.tsx",
          "operation": "modify",
          "description": "Remove Rate and Quantity columns from the table header and table body. Ensure the table shows only: Sr No, Size, Single Coating, Double Coating, Double Coating + Sagwan Patti, Laminate, and Sq.Ft columns."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Update totals section to show coating-specific totals and total square feet, remove Grand Total and Total Quantity",
      "acceptanceCriteria": [
        "Totals section appears below the door entries table",
        "Shows separate total for each coating type",
        "Shows Total Square Feet",
        "Does not show Grand Total",
        "Does not show Total Quantity"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GrandTotals.tsx",
          "operation": "modify",
          "description": "Remove Grand Total and Total Quantity displays. Ensure the component shows only: Single Coating Total, Double Coating Total, Double Coating + Sagwan Patti Total, Laminate Total, and Total Square Feet. Format amounts in Indian Rupees with comma separators."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure GrandTotals component is positioned below the DoorEntryList component in the layout to meet the requirement that totals appear below the table."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Fix WhatsApp PDF sharing to use native share API with actual PDF file attachment",
      "acceptanceCriteria": [
        "PDF is generated as a downloadable file blob",
        "Native share API is used for sharing",
        "WhatsApp receives PDF as file attachment",
        "Fallback behavior works if native share is unavailable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/whatsappShare.ts",
          "operation": "modify",
          "description": "Replace current implementation to use the Web Share API (navigator.share) with files parameter to share the PDF blob as a file attachment. Convert the PDF blob to a File object with appropriate MIME type (application/pdf) and filename. Implement fallback behavior for browsers that don't support Web Share API or file sharing."
        },
        {
          "path": "frontend/src/components/QuotationActions.tsx",
          "operation": "modify",
          "description": "Update the WhatsApp share handler to pass the PDF blob to the updated whatsappShare utility. Ensure the PDF blob is properly generated and available before triggering the share action."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Update confirmation message after quotation generation to display 'Quotation generated based on actual size.'",
      "acceptanceCriteria": [
        "Confirmation message displays after PDF generation",
        "Message reads exactly 'Quotation generated based on actual size.'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuotationActions.tsx",
          "operation": "modify",
          "description": "Update the success message shown after PDF generation to display exactly 'Quotation generated based on actual size.' Replace any existing success message text with this new message."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Update PDF to use actual entered dimensions with fractions and match updated UI table structure",
      "acceptanceCriteria": [
        "PDF shows actual entered dimensions with fractions",
        "PDF table structure matches UI table structure",
        "PDF totals section matches UI totals section",
        "No rate or quantity columns in PDF table"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "modify",
          "description": "Update PDF table generation to match the new UI table structure: remove Rate and Quantity columns, display actual entered dimensions (enteredHeight × enteredWidth) instead of rounded dimensions. Update the totals section in the PDF to show Single Coating Total, Double Coating Total, Double Coating + Sagwan Patti Total, Laminate Total, and Total Square Feet (remove Grand Total and Total Quantity). Ensure all formatting matches the updated UI specifications."
        }
      ]
    }
  ]
}